def solution(N, stages):
    answer = []
    calculate = dict()
    for n in range(1, N + 1):
        stop = 0
        total = len(stages)
        for stage in stages[:]:
            if stage <= n:
                stop += 1
                stages.remove(stage)
        print(n, stop/(total) * 100)
        calculate[n] = stop/(total) * 100
    return answer


print("answer: ", solution(5, [2, 1, 2, 6, 2, 4, 3, 3]))
# , [3, 4, 2, 1, 5]
"""
입출력 예 #1
1번 스테이지에는 총 8명의 사용자가 도전했으며, 이 중 1명의 사용자가 아직 클리어하지 못했다. 따라서 1번 스테이지의 실패율은 다음과 같다.

1 번 스테이지 실패율 : 1/8
2번 스테이지에는 총 7명의 사용자가 도전했으며, 이 중 3명의 사용자가 아직 클리어하지 못했다. 따라서 2번 스테이지의 실패율은 다음과 같다.

2 번 스테이지 실패율 : 3/7
마찬가지로 나머지 스테이지의 실패율은 다음과 같다.

3 번 스테이지 실패율 : 2/4
4번 스테이지 실패율 : 1/2
5번 스테이지 실패율 : 0/1
각 스테이지의 번호를 실패율의 내림차순으로 정렬하면 다음과 같다.

[3,4,2,1,5]
입출력 예 #2

모든 사용자가 마지막 스테이지에 있으므로 4번 스테이지의 실패율은 1이며 나머지 스테이지의 실패율은 0이다.

[4,1,2,3] """
